channel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


cellsX 50;
cellsY 50;
cellsZ 1;

scale   0.1;

vertices
(
    (0 0 0) // 0
    (5 0 0) // 1
    (5 1 0) // 2
    (0 1 0) // 3
    (0 0 0.1) // 4
    (2 0 0.1) // 5
    (2 1 0.1) // 6
    (0 1 0.1) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($cellsX $cellsY $cellsZ) simpleGrading 
    (
        8
        (   
            // expansión sobre el eje-y
            (0.2 0.25 8) // (%bloque %celdas coeficiente)
            (0.6 0.5 1) // (%bloque %celdas coeficiente)
            (0.2 0.25 0.125) // (%bloque %celdas coeficiente)
        )    
            // expansión sobre el eje-z
            1

    )
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
